tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_lpuart.c
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2022, 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_lpuart.h"

/*
 * $Coverage Justification Reference$
 *
 * $Justification fsl_lpuart_c_ref_1$
 * (osr > 3) (false) can't be not covered, because osr(osrTemp) is increased from 4U.
 *
 * $Justification fsl_lpuart_c_ref_2$
 * The flag is cleared successfully during test.
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.lpuart"
#endif

/* LPUART transfer state. */
enum
{
    kLPUART_TxIdle, /*!< TX idle. */
    kLPUART_TxBusy, /*!< TX busy. */
    kLPUART_RxIdle, /*!< RX idle. */
    kLPUART_RxBusy  /*!< RX busy. */
};

#if defined(LPUART_RSTS)
#define LPUART_RESETS_ARRAY LPUART_RSTS
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Check whether the RX ring buffer is full.
 *
 * @userData handle LPUART handle pointer.
 * @retval true  RX ring buffer is full.
 * @retval false RX ring buffer is not full.
 */
static bool LPUART_TransferIsRxRingBufferFull(LPUART_Type *base, lpuart_handle_t *handle);

/*!
 * @brief Write to TX register using non-blocking method.
 *
 * This function writes data to the TX register directly, upper layer must make
 * sure the TX register is empty or TX FIFO has empty room before calling this function.
 *
 * @note This function does not check whether all the data has been sent out to bus,
 * so before disable TX, check kLPUART_TransmissionCompleteFlag to ensure the TX is
 * finished.
 *
 * @param base LPUART peripheral base address.
 * @param data Start address of the data to write.
 * @param length Size of the buffer to be sent.
 */
static void LPUART_WriteNonBlocking(LPUART_Type *base, const uint8_t *data, size_t length);
/*!
 * @brief Write to TX register using non-blocking method in 9bit or 10bit mode.
 *
 * The 10bit of data will be writen to TX register DATA.
 * Please make sure data 10bit is valid and other bit is 0.
 *
 * @note This function only support 9bit or 10bit transfer.
 *
 * @param base LPUART peripheral base address.
 * @param data Start address of the data to write.
 * @param length Size of the buffer to be sent.
 */
static void LPUART_WriteNonBlocking16bit(LPUART_Type *base, const uint16_t *data, size_t length);

/*!
 * @brief Read RX register using non-blocking method.
 *
 * This function reads data from the TX register directly, upper layer must make
 * sure the RX register is full or TX FIFO has data before calling this function.
 *
 * @param base LPUART peripheral base address.
 * @param data Start address of the buffer to store the received data.
 * @param length Size of the buffer.
 */
static void LPUART_ReadNonBlocking(LPUART_Type *base, uint8_t *data, size_t length);
/*!
 * @brief Read RX register using non-blocking method in 9bit or 10bit mode.
 *
 * This function reads 10bit data from the RX register directly and stores to 16bit data.
 *
 * @note This function only support 9bit or 10bit transfer.
 *
 * @param base LPUART peripheral base address.
 * @param data Start address of the buffer to store the received data.
 * @param length Size of the buffer.
 */
static void LPUART_ReadNonBlocking16bit(LPUART_Type *base, uint16_t *data, size_t length);
/*!
 * @brief LPUART_TransferHandleIDLEIsReady handle function.
 * This function handles when IDLE is ready.
 *
 * @param base LPUART peripheral base address.
 * @param irqHandle LPUART handle pointer.
 */
static void LPUART_TransferHandleIDLEReady(LPUART_Type *base, lpuart_handle_t *handle);

/*!
 * @brief LPUART_TransferHandleReceiveDataIsFull handle function.
 * This function handles when receive data is full.
 *
 * @param base LPUART peripheral base address.
 * @param handle LPUART handle pointer.
 */
static void LPUART_TransferHandleReceiveDataFull(LPUART_Type *base, lpuart_handle_t *handle);

/*!
 * @brief LPUART_TransferHandleSendDataIsEmpty handle function.
 * This function handles when send data is empty.
 *
 * @param base LPUART peripheral base address.
 * @param irqHandle LPUART handle pointer.
 */
static void LPUART_TransferHandleSendDataEmpty(LPUART_Type *base, lpuart_handle_t *handle);

/*!
 * @brief LPUART_TransferHandleTransmissionIsComplete handle function.
 * This function handles Transmission complete and the interrupt is enabled.
 *
 * @param base LPUART peripheral base address.
 * @param irqHandle LPUART handle pointer.
 */
static void LPUART_TransferHandleTransmissionComplete(LPUART_Type *base, lpuart_handle_t *handle);

/*!
 * @brief Wait for read data availability and check for errors.
 *
 * This function polls the receiver register/FIFO and waits for data to be available.
 * It monitors and handles RX error conditions including overrun, parity, framing,
 * and noise errors during the wait period.
 *
 * @param base LPUART peripheral base address.
 * @retval kStatus_Success Data available, no errors.
 * @retval kStatus_LPUART_Timeout Timeout waiting for data.
 * @retval kStatus_LPUART_RxHardwareOverrun RX overrun error.
 * @retval kStatus_LPUART_ParityError Parity error.
 * @retval kStatus_LPUART_FramingError Framing error.
 * @retval kStatus_LPUART_NoiseError Noise error.
 * @retval kStatus_LPUART_FlagCannotClearManually Error flag cannot be cleared.
 */
static status_t LPUART_WaitForReadData(LPUART_Type *base);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/* Array of LPUART peripheral base address. */
static LPUART_Type *const s_lpuartBases[] = LPUART_BASE_PTRS;
/* Array of LPUART handle. */
void *s_lpuartHandle[ARRAY_SIZE(s_lpuartBases)];
/* Array of LPUART IRQ number. */
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
#if defined(LPUART_RX_IRQS)
static const IRQn_Type s_lpuartRxIRQ[] = LPUART_RX_IRQS;
#endif
#if defined(LPUART_TX_IRQS)
const IRQn_Type s_lpuartTxIRQ[]        = LPUART_TX_IRQS;
#endif
#else
#if defined(LPUART_RX_TX_IRQS)
const IRQn_Type s_lpuartIRQ[] = LPUART_RX_TX_IRQS;
#endif
#endif
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Array of LPUART clock name. */
static const clock_ip_name_t s_lpuartClock[] = LPUART_CLOCKS;

#if defined(LPUART_PERIPH_CLOCKS)
/* Array of LPUART functional clock name. */
static const clock_ip_name_t s_lpuartPeriphClocks[] = LPUART_PERIPH_CLOCKS;
#endif

#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/* LPUART ISR for transactional APIs. */
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
lpuart_isr_t s_lpuartIsr[ARRAY_SIZE(s_lpuartBases)] = {[0 ...(ARRAY_SIZE(s_lpuartBases) - 1)] =
                                                           (lpuart_isr_t)DefaultISR};
#else
lpuart_isr_t s_lpuartIsr[ARRAY_SIZE(s_lpuartBases)];
#endif

#if defined(LPUART_RESETS_ARRAY)
/* Reset array */
static const reset_ip_name_t s_lpuartResets[] = LPUART_RESETS_ARRAY;
#endif

